MikroElektronika/core_packages/PIC/XC8/def/PIC18F97J60/mcu.h
// Register: MACON1
#define MACON1 MACON1
extern volatile unsigned char           MACON1              __at(0xEA0);
#ifndef _LIB_BUILD
asm("MACON1 equ 0EA0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MARXEN                 :1;
        unsigned PASSALL                :1;
        unsigned RXPAUS                 :1;
        unsigned TXPAUS                 :1;
    };
} MACON1bits_t;
extern volatile MACON1bits_t MACON1bits __at(0xEA0);
// bitfield macros
#define _MACON1_MARXEN_POSN                                 0x0
#define _MACON1_MARXEN_POSITION                             0x0
#define _MACON1_MARXEN_SIZE                                 0x1
#define _MACON1_MARXEN_LENGTH                               0x1
#define _MACON1_MARXEN_MASK                                 0x1
#define _MACON1_PASSALL_POSN                                0x1
#define _MACON1_PASSALL_POSITION                            0x1
#define _MACON1_PASSALL_SIZE                                0x1
#define _MACON1_PASSALL_LENGTH                              0x1
#define _MACON1_PASSALL_MASK                                0x2
#define _MACON1_RXPAUS_POSN                                 0x2
#define _MACON1_RXPAUS_POSITION                             0x2
#define _MACON1_RXPAUS_SIZE                                 0x1
#define _MACON1_RXPAUS_LENGTH                               0x1
#define _MACON1_RXPAUS_MASK                                 0x4
#define _MACON1_TXPAUS_POSN                                 0x3
#define _MACON1_TXPAUS_POSITION                             0x3
#define _MACON1_TXPAUS_SIZE                                 0x1
#define _MACON1_TXPAUS_LENGTH                               0x1
#define _MACON1_TXPAUS_MASK                                 0x8

// Register: MACON3
#define MACON3 MACON3
extern volatile unsigned char           MACON3              __at(0xEA2);
#ifndef _LIB_BUILD
asm("MACON3 equ 0EA2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FULDPX                 :1;
        unsigned FRMLNEN                :1;
        unsigned HFRMEN                 :1;
        unsigned PHDREN                 :1;
        unsigned TXCRCEN                :1;
        unsigned PADCFG0                :1;
        unsigned PADCFG1                :1;
        unsigned PADCFG2                :1;
    };
    struct {
        unsigned                        :5;
        unsigned PADCFG                 :3;
    };
} MACON3bits_t;
extern volatile MACON3bits_t MACON3bits __at(0xEA2);
// bitfield macros
#define _MACON3_FULDPX_POSN                                 0x0
#define _MACON3_FULDPX_POSITION                             0x0
#define _MACON3_FULDPX_SIZE                                 0x1
#define _MACON3_FULDPX_LENGTH                               0x1
#define _MACON3_FULDPX_MASK                                 0x1
#define _MACON3_FRMLNEN_POSN                                0x1
#define _MACON3_FRMLNEN_POSITION                            0x1
#define _MACON3_FRMLNEN_SIZE                                0x1
#define _MACON3_FRMLNEN_LENGTH                              0x1
#define _MACON3_FRMLNEN_MASK                                0x2
#define _MACON3_HFRMEN_POSN                                 0x2
#define _MACON3_HFRMEN_POSITION                             0x2
#define _MACON3_HFRMEN_SIZE                                 0x1
#define _MACON3_HFRMEN_LENGTH                               0x1
#define _MACON3_HFRMEN_MASK                                 0x4
#define _MACON3_PHDREN_POSN                                 0x3
#define _MACON3_PHDREN_POSITION                             0x3
#define _MACON3_PHDREN_SIZE                                 0x1
#define _MACON3_PHDREN_LENGTH                               0x1
#define _MACON3_PHDREN_MASK                                 0x8
#define _MACON3_TXCRCEN_POSN                                0x4
#define _MACON3_TXCRCEN_POSITION                            0x4
#define _MACON3_TXCRCEN_SIZE                                0x1
#define _MACON3_TXCRCEN_LENGTH                              0x1
#define _MACON3_TXCRCEN_MASK                                0x10
#define _MACON3_PADCFG0_POSN                                0x5
#define _MACON3_PADCFG0_POSITION                            0x5
#define _MACON3_PADCFG0_SIZE                                0x1
#define _MACON3_PADCFG0_LENGTH                              0x1
#define _MACON3_PADCFG0_MASK                                0x20
#define _MACON3_PADCFG1_POSN                                0x6
#define _MACON3_PADCFG1_POSITION                            0x6
#define _MACON3_PADCFG1_SIZE                                0x1
#define _MACON3_PADCFG1_LENGTH                              0x1
#define _MACON3_PADCFG1_MASK                                0x40
#define _MACON3_PADCFG2_POSN                                0x7
#define _MACON3_PADCFG2_POSITION                            0x7
#define _MACON3_PADCFG2_SIZE                                0x1
#define _MACON3_PADCFG2_LENGTH                              0x1
#define _MACON3_PADCFG2_MASK                                0x80
#define _MACON3_PADCFG_POSN                                 0x5
#define _MACON3_PADCFG_POSITION                             0x5
#define _MACON3_PADCFG_SIZE                                 0x3
#define _MACON3_PADCFG_LENGTH                               0x3
#define _MACON3_PADCFG_MASK                                 0xE0

// Register: MACON4
#define MACON4 MACON4
extern volatile unsigned char           MACON4              __at(0xEA3);
#ifndef _LIB_BUILD
asm("MACON4 equ 0EA3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned                        :1;
        unsigned DEFER                  :1;
    };
} MACON4bits_t;
extern volatile MACON4bits_t MACON4bits __at(0xEA3);
// bitfield macros
#define _MACON4_DEFER_POSN                                  0x6
#define _MACON4_DEFER_POSITION                              0x6
#define _MACON4_DEFER_SIZE                                  0x1
#define _MACON4_DEFER_LENGTH                                0x1
#define _MACON4_DEFER_MASK                                  0x40

// Register: MABBIPG
#define MABBIPG MABBIPG
extern volatile unsigned char           MABBIPG             __at(0xEA4);
#ifndef _LIB_BUILD
asm("MABBIPG equ 0EA4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BBIPG0                 :1;
        unsigned BBIPG1                 :1;
        unsigned BBIPG2                 :1;
        unsigned BBIPG3                 :1;
        unsigned BBIPG4                 :1;
        unsigned BBIPG5                 :1;
        unsigned BBIPG6                 :1;
    };
} MABBIPGbits_t;
extern volatile MABBIPGbits_t MABBIPGbits __at(0xEA4);
// bitfield macros
#define _MABBIPG_BBIPG0_POSN                                0x0
#define _MABBIPG_BBIPG0_POSITION                            0x0
#define _MABBIPG_BBIPG0_SIZE                                0x1
#define _MABBIPG_BBIPG0_LENGTH                              0x1
#define _MABBIPG_BBIPG0_MASK                                0x1
#define _MABBIPG_BBIPG1_POSN                                0x1
#define _MABBIPG_BBIPG1_POSITION                            0x1
#define _MABBIPG_BBIPG1_SIZE                                0x1
#define _MABBIPG_BBIPG1_LENGTH                              0x1
#define _MABBIPG_BBIPG1_MASK                                0x2
#define _MABBIPG_BBIPG2_POSN                                0x2
#define _MABBIPG_BBIPG2_POSITION                            0x2
#define _MABBIPG_BBIPG2_SIZE                                0x1
#define _MABBIPG_BBIPG2_LENGTH                              0x1
#define _MABBIPG_BBIPG2_MASK                                0x4
#define _MABBIPG_BBIPG3_POSN                                0x3
#define _MABBIPG_BBIPG3_POSITION                            0x3
#define _MABBIPG_BBIPG3_SIZE                                0x1
#define _MABBIPG_BBIPG3_LENGTH                              0x1
#define _MABBIPG_BBIPG3_MASK                                0x8
#define _MABBIPG_BBIPG4_POSN                                0x4
#define _MABBIPG_BBIPG4_POSITION                            0x4
#define _MABBIPG_BBIPG4_SIZE                                0x1
#define _MABBIPG_BBIPG4_LENGTH                              0x1
#define _MABBIPG_BBIPG4_MASK                                0x10
#define _MABBIPG_BBIPG5_POSN                                0x5
#define _MABBIPG_BBIPG5_POSITION                            0x5
#define _MABBIPG_BBIPG5_SIZE                                0x1
#define _MABBIPG_BBIPG5_LENGTH                              0x1
#define _MABBIPG_BBIPG5_MASK                                0x20
#define _MABBIPG_BBIPG6_POSN                                0x6
#define _MABBIPG_BBIPG6_POSITION                            0x6
#define _MABBIPG_BBIPG6_SIZE                                0x1
#define _MABBIPG_BBIPG6_LENGTH                              0x1
#define _MABBIPG_BBIPG6_MASK                                0x40

// Register: MAIPG
#define MAIPG MAIPG
extern volatile unsigned short          MAIPG               __at(0xEA6);
#ifndef _LIB_BUILD
asm("MAIPG equ 0EA6h");
#endif

// Register: MAIPGL
#define MAIPGL MAIPGL
extern volatile unsigned char           MAIPGL              __at(0xEA6);
#ifndef _LIB_BUILD
asm("MAIPGL equ 0EA6h");
#endif

